Public Attributes | List of all members
API_HotlinkType Struct Reference
Element Manager API
Represents a Hotlink Module type or XRef type hotlink instance element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_HotlinkTypeID  | type
Type of the hotlink.
API_Guid  | hotlinkNodeGuid
Reference to the associated hotlink node (see API_HotlinkNode).
API_Guid  | hotlinkGroupGuid
Reference to the associated element group.
API_Tranmat  | transformation
Placement transformation of the hotlink instance.
short  | floorDifference
Floor difference in case of hotlink module.
bool  | suspendFixAngle
Adjust angle of fixed-angle elements to reflect module rotation.
bool  | skipNested
Skip nested hotlinks.
bool  | ignoreTopFloorLinks
Top linked building elements will not keep their top floor links (homeFloorLinksOnly before 19).
bool  | relinkWallOpenings
Wall openings linked to stories will be relinked to walls to follow their elevation if the story structures differ.
bool  | adjustLevelDiffs
If this parameter is true, then all Hotlink elements will retain their original vertical position relative to the Hotlink insertion point. Otherwise elevation of elements will follow the shift in Story Levels in the Host Project. Therefore, Hotlink element may shift vertically.
Detailed Description
Represents a Hotlink Module type or XRef type hotlink instance element.
Member Data Documentation
◆ adjustLevelDiffs
 API_HotlinkType::adjustLevelDiffs
If this parameter is true, then all Hotlink elements will retain their original vertical position relative to the Hotlink insertion point. Otherwise elevation of elements will follow the shift in Story Levels in the Host Project. Therefore, Hotlink element may shift vertically.
◆ floorDifference
 API_HotlinkType::floorDifference
Floor difference in case of hotlink module.
◆ head
 API_HotlinkType::head
General element header.
◆ hotlinkGroupGuid
 API_HotlinkType::hotlinkGroupGuid
Reference to the associated element group.
◆ hotlinkNodeGuid
 API_HotlinkType::hotlinkNodeGuid
Reference to the associated hotlink node (see API_HotlinkNode).
◆ ignoreTopFloorLinks
 API_HotlinkType::ignoreTopFloorLinks
Top linked building elements will not keep their top floor links (homeFloorLinksOnly before 19).
◆ relinkWallOpenings
 API_HotlinkType::relinkWallOpenings
Wall openings linked to stories will be relinked to walls to follow their elevation if the story structures differ.
◆ skipNested
 API_HotlinkType::skipNested
Skip nested hotlinks.
◆ suspendFixAngle
 API_HotlinkType::suspendFixAngle
Adjust angle of fixed-angle elements to reflect module rotation.
◆ transformation
 API_HotlinkType::transformation
Placement transformation of the hotlink instance.
◆ type
 API_HotlinkType::type
Type of the hotlink.